# print('c b a d')
# for a in 0,1:
#     for b in 0,1:
#         for c in 0,1:
#             for d in 0,1:
#                 f = (a and b == (not c)) and (b <= d)
#                 print(c, b, a, d)
# print(set('AbraCadabra'))

# a = list(map(int, open('27.txt')))
# k = 0
# for i in range(len(a) - 1):
#     for j in range(i, len(a)):
#         if (a[i] * a[j]) % 62 == 0:
#             k += 1
#             print(i, j)
# print(k)

print(len('Культура - неотъемлемая часть жизни человека, так как её мы создаем сами и только от нас будет зависеть дальнейшее её развитие. Почему гражданам необходимо сохранять культурную среду? Я считаю, что культурную среду необходимо сохранять для того. чтобы не забывать прошлое своей страны, предков, для морального и духовного воспитания. Для обоснования своей точки зрения обращусь к примеру из литературного произведения. Лихачёв Дмитрий Сергеевич в своём произведении "Письма о добром и прекрасном" затрагивает вопрос о роли культуры в жизни человека. Он считает, что культура имеет воспитательные воздействия на человека, а также она важна для моральной и духовной его жизни. Парки, памятники, площади, старые фотографии - это всё то, что помогает людям хранить память о событиях, минувших нас, о значимых людях и сохранять культурную среду и можно даже сказать, что граждане, не интересующиеся ими, не любят свою семью, страну, народ. Также автор пишет что если биологическая среда ещё восстановима, то вот культурную восстановить невозможно, и поэтому её нужно беречь. Данный пример нам показывает что людям важно сохранять культурную среду, ведь иначе мы потеряем всё то, что люди накапливали годами. Подводя итог вышесказанному, хотелось бы отметить что сохранение культурной среды зависит от каждого человека: от любви его к культуре, от желания передавать свои знания другим людям.'.split()))

